AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common/examples/iox4p_fpga/src/iox4.c
//////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Module:  iox4
// Author:   Xiaoping Yang
// Date: 11/26/2021
// Description: Updated Apollo4p MCU Card Apollo IO expander code to support rev.C silicon
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "am_mcu_apollo.h"
#include "iox4.h"
#include <stdio.h>
#include "am_util_delay.h"
#include <string.h>

#define TRIM 0
#define SECURE 1 // Apollo3/3c/4a
#define SECURE_AP4B 2 // Apollo4b
#define SWDIO 8
#define SWDCK 7

// Prototypes
//int main(void) __attribute__((section("data")));
//int main(void) CODE_SECTION;
void toggle_led (uint32_t, uint32_t);
void update_amux_sel (uint32_t, uint32_t);
void fabd_unlock (uint32_t);
void iox_update_state(uint32_t iox_index);
void iox_update_state_all(void);
void iox_write_pio(uint32_t pio_num, uint32_t op);
void iox_set_default_states(void);

uint32_t g_operational_mode = MODE_DEFAULT;
uint32_t g_ioe_state[4] = {0xFFFFFFFF, 0x00FFFFFF, 0xFFFFFFFF, 0x00FFFFFF};

// Main code
int main (void) {
    uint32_t k;
    uint32_t cmd;
    uint32_t pio_num, op;
    uint32_t operational_mode = 0xFFFFFFFF;

    // Enable the keys for all the modules
    AM_REG(CLKGEN, CLKKEY) = AM_REG_CLKGEN_CLKKEY_KEYVAL;

    AM_REG(GPIO, PADKEY) = 0x73;

    //********************************************************
    // SET UP GPIO0-6 (same for all boards)
    //********************************************************

    //--------------------------------------------------------
    // Set up the pin muxing - IOS SPI mode
    //--------------------------------------------------------
    //
    AM_REG(GPIO, PADREGA) = AM_REG_GPIO_PADREGA_PAD3FNCSEL(1) |
                            AM_REG_GPIO_PADREGA_PAD2FNCSEL(1) |
                            AM_REG_GPIO_PADREGA_PAD1FNCSEL(1) |
                            AM_REG_GPIO_PADREGA_PAD0FNCSEL(1) |
                            AM_REG_GPIO_PADREGA_PAD3INPEN(1)|
                            AM_REG_GPIO_PADREGA_PAD2INPEN(1)|
                            AM_REG_GPIO_PADREGA_PAD1INPEN(1)|
                            AM_REG_GPIO_PADREGA_PAD0INPEN(1) ;

    AM_REG(GPIO, CFGA) = AM_REG_GPIO_CFGA_GPIO3OUTCFG(0x3) |
                         AM_REG_GPIO_CFGA_GPIO2OUTCFG(0x3) |
                         AM_REG_GPIO_CFGA_GPIO1OUTCFG(0x3) |
                         AM_REG_GPIO_CFGA_GPIO0OUTCFG(0x3) ;

    //--------------------------------------------------------
    // Set up the pin muxing - IOM I2C mode
    //--------------------------------------------------------
    //

    //Pads remain same for apollo1 and apollo3
    AM_REG(GPIO, PADREGB) = AM_REG_GPIO_PADREGB_PAD5FNCSEL(0) |
                            AM_REG_GPIO_PADREGB_PAD6FNCSEL(0) |
                            AM_REG_GPIO_PADREGB_PAD6PULL(1) |
                            AM_REG_GPIO_PADREGB_PAD5PULL(1) |
                            AM_REG_GPIO_PADREGB_PAD5INPEN(1) |
                            AM_REG_GPIO_PADREGB_PAD6INPEN(1)     ;

    //--------------------------------------------------------
    // Set up the IOM device
    //--------------------------------------------------------

    // Defaults for the device

    AM_REGVAL(0x50005208) = 0xFFFFFFFF;
    while ((AM_REGVAL(0x50005118) & 4) != 4 );
    AM_REGVAL(0x50005108) = 0x40C;    //defaults from Ron
    AM_REGVAL(0x5000411C) = 0x80000000;     //IOMSTR0 CFG
    AM_REGVAL(0x5000410C) = 0x170b1100;     //CLK CFG
                        // AM_REG_IOMSTR0_CLKCFG_FSEL(1) |
                         //     AM_REG_IOMSTR0_DIV3(0) |
                          //     AM_REG_IOMSTR0_DIVEN(1) |
                           //      AM_REG_IOMSTR0_LOWPER(b) |
                            //      AM_REG_IOMSTR0_TOTPER(0x17);


//    iox_update_state_all();

    //--------------------------------------------------------
    // Set up the IO SLAVE device
    //--------------------------------------------------------
    // CKPT (CKPT_IOSLAVE,101);          // Word accesses

    // Set up the clocks
    AM_REG(CLKGEN, CCTRL) = 0;

    // There are 3 different modes to access the ioslave. Split up in units of 8byte chunks
    //    1. Direct area from 0 to FIFOBASE, 120 bytes max. Shared access between external/internal. This can be hooked
    //        to the ISR in the different fields.
    //    2. Fifo area for ios to device data, accessed from address 0x7F externally (always this address).
    //    3. RAM area for internal MCU read access only.  The external master cannot get to this.  FIFOMAX to 0xFF
    // Enable the ioslave interface
    AM_REG(IOSLAVE, CFG) = AM_REG_IOSLAVE_CFG_IFCEN(0x1) |
                           AM_REG_IOSLAVE_CFG_LSB(0x0)   |
                           AM_REG_IOSLAVE_CFG_SPOL(0x0)  |
                           AM_REG_IOSLAVE_CFG_IFCSEL(0x1);

    AM_REG(IOSLAVE, FIFOCFG) = AM_REG_IOSLAVE_FIFOCFG_ROBASE(0x04) |
                               AM_REG_IOSLAVE_FIFOCFG_FIFOMAX(0x1F) |
                               AM_REG_IOSLAVE_FIFOCFG_FIFOBASE(0x10);

    AM_REG(IOSLAVE, FIFOPTR) = AM_REG_IOSLAVE_FIFOPTR_FIFOSIZ(0) |
                               AM_REG_IOSLAVE_FIFOPTR_FIFOPTR(0x80);

    AM_REG(IOSLAVE, FIFOCTR) = AM_REG_IOSLAVE_FIFOCTR_FIFOCTR(0x200);

    // Load IOX Signature into address 0x40/0x41
#if defined(BOARD_FALCON_PS_CARD)
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x40) = 0x21;
#elif defined(BOARD_FALCON_SIP_MCU_CARD_REVA)
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x40) = 0x22;
#elif defined(BOARD_FALCON_BGA_MCU_CARD_REVA)
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x40) = 0x23;
#elif defined(BOARD_FALCON_SIP_MCU_CARD_REVB)
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x40) = 0x24;
#elif defined(BOARD_FALCON_BGA_MCU_CARD_REVB)
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x40) = 0x25;
#endif
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x41) = 0xA5;
    //AM_REGVAL(REG_IOSLAVE_BASEADDR+0x42) = 0x0D; //version 13. Rev.B silicon FABD and Rev.B MCU card support
    AM_REGVAL(REG_IOSLAVE_BASEADDR+0x42) = 0x0E; //version 14. Rev.B power mux inversion

