AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common/examples/iox4p_fpga/src/iox4.c
    for (k=7; k<50; k++) {
        if (k == 20 || k == 21) {
            continue;
        } else {
            am_hal_gpio_pin_config(k, AM_HAL_PIN_3STATE); // tristate output on every pad after startup
        }
    }

    // Configure the LED and toggle twice
    am_hal_gpio_pin_config(GPIO_LED_BLUE, AM_HAL_GPIO_OUTPUT);
    toggle_led(3,300);
    am_hal_gpio_out_bit_set(GPIO_LED_BLUE);

    am_hal_gpio_pin_config(GPIO_SW2, AM_HAL_GPIO_INPUT);
    am_hal_gpio_int_clear(AM_HAL_GPIO_BIT(GPIO_SW2));
    am_hal_gpio_int_enable(AM_HAL_GPIO_BIT(GPIO_SW2));
    am_hal_interrupt_enable(AM_HAL_INTERRUPT_GPIO);
    am_hal_interrupt_master_enable();

//    iox_set_default_states();
//    iox_update_state_all();

    while(1)
    {
        if(g_operational_mode != operational_mode)
        {
            operational_mode = g_operational_mode;
            toggle_led(operational_mode, 200);
            switch(operational_mode)
            {
                case 0: // Default mode. MSPI2 QSPI Display & MSPI0 to 1.8V PSRAM
                    iox_set_default_states();
                    //MSPI2 Muxes
                    iox_write_pio(GPIO_MSPI2_SEL3, 0);
                    iox_write_pio(GPIO_MSPI2_SEL2, 1);
                    iox_write_pio(GPIO_MSPI2_SEL1, 0);
                    iox_write_pio(GPIO_MSPI2_SEL0, 0);
                    //MSPI0 Muxes
                    iox_write_pio(GPIO_MSPI0_SEL3, 0);
                    iox_write_pio(GPIO_MSPI0_SEL2, 0);
                    iox_write_pio(GPIO_MSPI0_SEL1, 1);
                    iox_write_pio(GPIO_MSPI0_SEL0, 0);
                    //Get GP52 for CEn to FPGA Header
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL1, 1);
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL0, 0);
                    //Get MSPI0 and new MSPI1 pins to FPGA Header
                    iox_write_pio(GPIO_UPPER_IO_CTRL, 0);
                    iox_write_pio(GPIO_PC_SEL, 0);
                    iox_write_pio(GPIO_AT_UART_SEL, 1);
                    //IOM Muxes
                    iox_write_pio(GPIO_IOM0_LB_SEL, 1);
                    iox_write_pio(GPIO_IOM_PC_SEL, 0);
                    iox_write_pio(GPIO_IOM_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_VOLT_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 1);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 1);
                    //break;
                case 1: // IOMx SPI to 1.8V PSRAM
                    iox_write_pio(GPIO_IOM0_LB_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_PC_SEL, 0);
                    iox_write_pio(GPIO_IOM_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_VOLT_SEL, 1);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
                    break;
                case 2: // IOMx I2C to FRAM
                    iox_write_pio(GPIO_IOM_ANA_SEL, 1);
                    iox_write_pio(GPIO_IOM_VOLT_SEL, 1);
                    iox_write_pio(GPIO_IOM0_LB_SEL, 0);
                    iox_write_pio(GPIO_IOM_PC_SEL, 0);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 0);
                    break;
                case 3: // IOM0 to IOS Loopback
                    //IOM0 Muxes
                    iox_write_pio(GPIO_IOM0_LB_SEL, 1);
                    iox_write_pio(GPIO_IOM_PC_SEL, 1);
                    iox_write_pio(GPIO_IOM_ANA_SEL, 0);
					iox_write_pio(GPIO_IOM_VOLT_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 1);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
					//IOS Muxes
                    iox_write_pio(GPIO_IOS_LB_SEL, 1);
					iox_write_pio(GPIO_AT_UART_SEL, 0);
					iox_write_pio(GPIO_PC_SEL, 0);
					// High Z the MSPI0 & MSPI1 Muxes
					iox_write_pio(GPIO_MSPI2_SEL3, 0);
                    iox_write_pio(GPIO_MSPI2_SEL2, 0);
                    iox_write_pio(GPIO_MSPI2_SEL1, 0);
                    iox_write_pio(GPIO_MSPI2_SEL0, 0);
                    iox_write_pio(GPIO_MSPI0_SEL3, 0);
                    iox_write_pio(GPIO_MSPI0_SEL2, 0);
                    iox_write_pio(GPIO_MSPI0_SEL1, 0);
                    iox_write_pio(GPIO_MSPI0_SEL0, 0);
                    break;
                case 4: // MSPI0&MSPI2 to 1.8V Quad PSRAM + MSPI0 Octal SPI Flash
                    //MSPI2 Muxes
                    iox_write_pio(GPIO_MSPI2_SEL3, 0);
                    iox_write_pio(GPIO_MSPI2_SEL2, 1);
                    iox_write_pio(GPIO_MSPI2_SEL1, 0);//modified
                    iox_write_pio(GPIO_MSPI2_SEL0, 0);//modified
                    //MSPI0 Muxes
                    iox_write_pio(GPIO_MSPI0_SEL3, 0);
                    iox_write_pio(GPIO_MSPI0_SEL2, 1);
                    iox_write_pio(GPIO_MSPI0_SEL1, 0);//modified
                    iox_write_pio(GPIO_MSPI0_SEL0, 0);//modified
                    //IOS Muxes and Additional I/O Muxes(MSPI0 & MSPI2 CE Muxes)
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL1, 1);
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL0, 1);
                    iox_write_pio(GPIO_IOS_LB_SEL, 0);//modified
					iox_write_pio(GPIO_AT_UART_SEL, 0);
                    iox_write_pio(GPIO_PC_SEL, 0);
                    iox_write_pio(GPIO_UPPER_IO_CTRL, 0);
                    //IOM Muxes
                    iox_write_pio(GPIO_IOM0_LB_SEL, 0);//modified
                    iox_write_pio(GPIO_IOM_PC_SEL, 0);
                    iox_write_pio(GPIO_IOM_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_VOLT_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
                    break;
                case 5: // MSPI0 to Display
                    //MSPI0 Muxes
                    iox_write_pio(GPIO_MSPI0_SEL3, 1);
                    iox_write_pio(GPIO_MSPI0_SEL2, 1);
                    iox_write_pio(GPIO_MSPI0_SEL1, 0);
                    iox_write_pio(GPIO_MSPI0_SEL0, 0);
                    //MSPI2 Muxes
                    iox_write_pio(GPIO_MSPI2_SEL3, 0);
                    iox_write_pio(GPIO_MSPI2_SEL2, 0);
                    iox_write_pio(GPIO_MSPI2_SEL1, 0);
                    iox_write_pio(GPIO_MSPI2_SEL0, 0);
                    //IOM Muxes
                    iox_write_pio(GPIO_IOM0_LB_SEL, 0);
                    iox_write_pio(GPIO_IOM_PC_SEL, 0);
                    iox_write_pio(GPIO_IOM_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_VOLT_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
                    break;
                case 6: // DC QSPI Display & MSPI0 to 1.8V PSRAM
                    //MSPI2 Muxes
                    iox_write_pio(GPIO_MSPI2_SEL3, 1);
                    iox_write_pio(GPIO_MSPI2_SEL2, 1);
                    iox_write_pio(GPIO_MSPI2_SEL1, 0);
                    iox_write_pio(GPIO_MSPI2_SEL0, 0);
                    //MSPI0 Muxes
                    iox_write_pio(GPIO_MSPI0_SEL3, 0);
                    iox_write_pio(GPIO_MSPI0_SEL2, 0);
                    iox_write_pio(GPIO_MSPI0_SEL1, 1);
                    iox_write_pio(GPIO_MSPI0_SEL0, 0);
                    //Get GP52 for CEn to FPGA Header
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL1, 1);
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL0, 0);
                    //Get MSPI0 and new MSPI1 pins to FPGA Header
                    iox_write_pio(GPIO_UPPER_IO_CTRL, 0);
                    iox_write_pio(GPIO_PC_SEL, 0);
                    iox_write_pio(GPIO_AT_UART_SEL, 1);
                    //IOM Muxes
                    iox_write_pio(GPIO_IOM0_LB_SEL, 0);
                    iox_write_pio(GPIO_IOM_PC_SEL, 0);
                    iox_write_pio(GPIO_IOM_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_VOLT_SEL, 0);
                    iox_write_pio(GPIO_IOM1_ANA_SEL, 0);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
                    break;
                case 7: // Peripheral Card Connections(what is this?)
                    iox_write_pio(GPIO_PC_SEL, 1);
                    iox_write_pio(GPIO_UPPER_IO_CTRL, 0);
                    iox_write_pio(GPIO_IOM_PC_SEL, 1);
                    iox_write_pio(GPIO_IOM_MEM_SEL, 0);
#ifdef BOARD_FALCON_EB
                    iox_write_pio(GPIO_DMUX_NC_SEL, 0);
                    iox_write_pio(GPIO_IOM_NC_SEL, 0);
                    iox_write_pio(GPIO_IOM1_DISP_SEL, 0);
                    iox_write_pio(GPIO_IOM7_NC_SEL, 0);
#endif
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL1, 0);
                    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL0, 1);
                    iox_write_pio(GPIO_MSPI2_SEL1, 0);
                    iox_write_pio(GPIO_MSPI2_SEL0, 1);
                    iox_write_pio(GPIO_MSPI0_SEL1, 0);
                    iox_write_pio(GPIO_MSPI0_SEL0, 1);
                    break;
                default: // All PIOs HIGH
                    g_ioe_state[0] = 0xFFFFFFFF;
                    g_ioe_state[1] = 0x00FFFFFF;
                    g_ioe_state[2] = 0xFFFFFFFF;
                    g_ioe_state[3] = 0x00FFFFFF;
                    break;
            }
            iox_update_state_all();
        }
        // TODO: Update this code for FPGA SPI writes to control muxes
        if(AM_REG(IOSLAVE, REGACCINTSTAT))
        {                   // If interrupt is found, it means a PIO output needs to be changed
            for (uint32_t h = 0; h < 1000; h++)
            {
                cmd = AM_REGVAL(REG_IOSLAVE_BASEADDR);
            }
            pio_num = cmd & 0xFF;
            op = ((cmd & 0xFF00)>>8);
            if (pio_num == 255 && op == 0)
            {
                fabd_unlock(TRIM);
            }
            if (pio_num == 255 && op == 1)
            {
                fabd_unlock(SECURE);
            }
            if (pio_num == 254 && op == 1)
            {
                fabd_unlock(SECURE_AP4B);
            }
            if (pio_num == 20 || pio_num == 21 || pio_num < 7)
            {
                AM_REG(IOSLAVE, REGACCINTCLR) = 0xFFFFFFFF;     // Clear the interrupt
                continue;
            }
            iox_write_pio(pio_num, op);
            if (pio_num > 49)
            {
                iox_update_state_all();
            }
            AM_REG(IOSLAVE, REGACCINTCLR) = 0xFFFFFFFF;         // Clear the interrupt
        }
    }
}

// Write latest state to the IOX
void iox_update_state(uint32_t iox_index)
{
    if (iox_index == 0)
    {
        // Load the FIFO
        AM_REGVAL(0x50004000) = g_ioe_state[0];
        AM_REGVAL(0x50004000) = g_ioe_state[1];

