AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common/examples/iox4p_fpga/src/iox4.c
        // Wait for FIFO load complete
        while ((AM_REGVAL(0x50004100) & 0x3F) < 8);

        // Execute Write command
        AM_REGVAL(0x50004110) = 0x40200006;

    }
    else if (iox_index == 1)
    {
        // Load the FIFO
        AM_REGVAL(0x50004000) = g_ioe_state[2];
        AM_REGVAL(0x50004000) = g_ioe_state[3];

        // Wait for FIFO load complete
        while ((AM_REGVAL(0x50004100) & 0x3F) < 8);

        // Execute Write command
        AM_REGVAL(0x50004110) = 0x40210006;
    }

    while (AM_REGVAL(0x50004118) != 4);

}

// Update all of the IOXs
void iox_update_state_all(void)
{
    iox_update_state(0);
    iox_update_state(1);
}

// void iox_write_pio(uint32_t pio_num, uint32_t op)
//
// Change the state of a single PIO
//
// Note for PIO >= 50, this only updates the g_ioe_state[]
// variables. It is necessary to call iox_update_state(0)
// and iox_update_state(1) after all pios have been written
void iox_write_pio(uint32_t pio_num, uint32_t op)
{
    uint32_t offset = 0;
    uint32_t ioe_state_index = 0;
    uint32_t ioe_data = 0;
    uint32_t ioe_mask = 0;
    if ( (pio_num > 12 && pio_num < 17) || (pio_num == 18) || (pio_num > 50 && pio_num < 56) || (pio_num == 61) ||
        (pio_num == 64) || (pio_num == 74) || (pio_num > 97 && pio_num < 118) )
    {
        if ( (op == 0) || (op == 1) ) {
            op = 1 - op;
        }
    }
    if (pio_num < 50) {
      if (op == 0) {
        // MSG(("set level =%d\n", op));
        am_hal_gpio_pin_config(pio_num, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);
        am_hal_gpio_out_enable_bit_set(pio_num);
        am_hal_gpio_out_bit_clear(pio_num);
      }
      if (op == 1) {
        // MSG(("set level =%d\n", op));
        am_hal_gpio_pin_config(pio_num, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);
        am_hal_gpio_out_enable_bit_set(pio_num);
        am_hal_gpio_out_bit_set(pio_num);
      }
      if (op == 2) {
        // MSG(("tristate PIO \n"));
        am_hal_gpio_pin_config(pio_num, AM_HAL_PIN_3STATE);
        am_hal_gpio_out_enable_bit_clear(pio_num);
      }
    }
    else
    {
        // IOX pio
        if (pio_num < 82)
        {
            offset = 50;
            ioe_state_index = 0;
        }
        else if (pio_num < 98)
        {
            offset = 82;
            ioe_state_index = 1;
        }
        else if (pio_num < 130)
        {
            offset = 98;
            ioe_state_index = 2;
        }
        else if (pio_num < 146)
        {
            offset = 130;
            ioe_state_index = 3;
        }
        ioe_mask = (1 << (pio_num - offset));
        ioe_data = g_ioe_state[ioe_state_index];
        if (op == 0) {
           if ((g_ioe_state[ioe_state_index] & ioe_mask) == ioe_mask) {
              g_ioe_state[ioe_state_index] = ioe_data - ioe_mask;
           }
        } else if (op == 1) {
           g_ioe_state[ioe_state_index] = g_ioe_state[ioe_state_index] | ioe_mask;
        } else {
         //do nothing
        }
    }


}

void toggle_led (uint32_t num_times, uint32_t delay_ms) {
    uint32_t k;
    for (k = 0; k < (num_times); k++) {
        am_hal_gpio_out_bit_toggle(GPIO_LED_BLUE);
        am_util_delay_ms(delay_ms);
        am_hal_gpio_out_bit_toggle(GPIO_LED_BLUE);
        am_util_delay_ms(delay_ms);
    }
}

void fabd_unlock (uint32_t type) {
    uint32_t i,j;
    //uint32_t trim1, trim2, trim3;
    uint32_t unlock_trim_seq[3] = {0x00FFFFFF, 0xA8FBFFFF, 0x77331303};
    uint32_t unlock_secure_seq[3] = {0x0D5C0CEF, 0x00780D5C, 0x67670357};
    uint32_t unlock_secure_seq_ap4b[11] = {0xFFFFFFFC, 0x000FFFFF, 0xE4FFFF30, 0x4FF86F3A, 0x80E4E1C7, 0x069D2A7C, 0xDACED7B6, 0x3AA2F66D, 0x255CAF5D, 0x6176EBDE, 0x00014F23};
    //FABD unlock trim sequence
    //trim1 = 0x00FFFFFF;
    //trim2 = 0xA8FBFFFF;
    //trim3 = 0x77331303;

    //Drive SWDCK low
    am_hal_gpio_pin_config(SWDCK, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);
    am_hal_gpio_out_enable_bit_set(SWDCK);
    am_hal_gpio_out_bit_clear(SWDCK);

    //Drive SWDIO low
    am_hal_gpio_pin_config(SWDIO, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);
    am_hal_gpio_out_enable_bit_set(SWDIO);
    am_hal_gpio_out_bit_clear(SWDIO);

    //Switch debugger connection
    am_hal_gpio_pin_config(9, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);
    am_hal_gpio_pin_config(10, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);  //jh added
    am_hal_gpio_pin_config(11, AM_HAL_PIN_OUTPUT | AM_HAL_GPIO_HIGH_DRIVE);  //jh added
    am_hal_gpio_out_enable_bit_set(9);
    am_hal_gpio_out_enable_bit_set(10); //jh added
    am_hal_gpio_out_enable_bit_set(11); //jh added
    for (i = 0; i < 1000; i++) {
        am_hal_gpio_out_bit_set(9); //jh changed
        am_hal_gpio_out_bit_set(10); //jh added
        am_hal_gpio_out_bit_clear(11); //jh added
    }
    //Send FABD unlock trim sequence on SWDCK and SWDIO
    if (type == TRIM) {
        for (i = 0; i < 24; i++) {
            //Read SWDIO sequence and change state
            if ( ((unlock_trim_seq[0]>>i)&1) == 1 ) {
                am_hal_gpio_out_bit_set(SWDIO);
            } else {
                am_hal_gpio_out_bit_clear(SWDIO);
            }
            //clock SWDCK
            am_hal_gpio_out_bit_set(SWDCK);
            am_hal_gpio_out_bit_clear(SWDCK);
        }
        for (j = 1; j < 3; j++) {
            for (i = 0; i < 32; i++) {
                //Read SWDIO sequence and change state
                if ( ((unlock_trim_seq[j]>>i)&1) == 1 ) {
                    am_hal_gpio_out_bit_set(SWDIO);
                } else {
                    am_hal_gpio_out_bit_clear(SWDIO);
                }
                //clock SWDCK
                am_hal_gpio_out_bit_set(SWDCK);
                am_hal_gpio_out_bit_clear(SWDCK);
            }
        }
    }
    //Send FABD unlock secure sequence on SWDCK and SWDIO for Apollo3/3c/4a
    if (type == SECURE) {
        for (j = 0; j < 3; j++) {
            for (i = 0; i < 32; i++) {
                //Read SWDIO sequence and change state
                if ( ((unlock_secure_seq[j]>>i)&1) == 1 ) {
                    am_hal_gpio_out_bit_set(SWDIO);
                } else {
                    am_hal_gpio_out_bit_clear(SWDIO);
                }
                //clock SWDCK
                am_hal_gpio_out_bit_set(SWDCK);
                am_hal_gpio_out_bit_clear(SWDCK);
            }
        }
    }

