AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common/examples/iox4p_fpga/src/iox4.c
    //Send FABD unlock secure sequence on SWDCK and SWDIO for Apollo4b
    if (type == SECURE_AP4B) {
        for (j = 0; j < 11; j++) {
            for (i = 0; i < 32; i++) {
                //Read SWDIO sequence and change state
                if ( ((unlock_secure_seq_ap4b[j]>>i)&1) == 1 ) {
                    am_hal_gpio_out_bit_set(SWDIO);
                } else {
                    am_hal_gpio_out_bit_clear(SWDIO);
                }
                //clock SWDCK
                am_hal_gpio_out_bit_set(SWDCK);
                am_hal_gpio_out_bit_clear(SWDCK);
            }
        }
    }

    if (type != SECURE_AP4B) {
        //Send bus idle and reset
        am_hal_gpio_out_bit_clear(SWDIO);
        for (i = 0; i < 14; i++) {
            am_hal_gpio_out_bit_set(SWDCK);
            am_hal_gpio_out_bit_clear(SWDCK);
        }
        am_hal_gpio_out_bit_set(SWDCK);
        for (i = 0; i < 50; i++) {
            am_hal_gpio_out_bit_set(SWDCK);
            am_hal_gpio_out_bit_clear(SWDCK);
        }
    }

    for (i = 0; i < 1000; i++) {
        am_hal_gpio_out_bit_clear(9);
    }
    //Switch debugger connection
    am_hal_gpio_pin_config(9, AM_HAL_PIN_3STATE); //jh updated
    am_hal_gpio_pin_config(10, AM_HAL_PIN_3STATE); //jh added
    //am_hal_gpio_pin_config(11, AM_HAL_PIN_3STATE); //jh added
    //am_hal_gpio_out_bit_clear(9); //jh changed
    //am_hal_gpio_out_bit_set(10); //jh added
    am_hal_gpio_out_bit_set(11); //jh added
    //Tristate SWDIO and SWDCK
    am_hal_gpio_pin_config(SWDIO, AM_HAL_PIN_3STATE);
    am_hal_gpio_pin_config(SWDCK, AM_HAL_PIN_3STATE);
}

void iox_set_default_states(void)
{
    // Power Muxes
    iox_write_pio(GPIO_CTRL_RAIL_PSU, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDC, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDC_LV, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDF, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDS, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDBH, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDC_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDC_LV_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDF_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDS_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDSBH_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_PER, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_PER_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDUSB0P9, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDUSB0P9_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDUSB33, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDUSB33_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDAUDA, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDAUDA_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDD18, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDD18_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDAUDD, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDB, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDH2, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDP, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDH, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDA, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDAUDD_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDB_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDH2_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDP_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDH_A, POWER_MUX_STATE);
    iox_write_pio(GPIO_CTRL_VDDA_A, POWER_MUX_STATE);

    // Other muxes
    iox_write_pio(GPIO_USB_PWR_EN, 0);
    iox_write_pio(GPIO_SHELBY_ADC_REF_LOAD_EN, 0);
    iox_write_pio(GPIO_CTRL_VCCIO_FPGA, 0);
    iox_write_pio(GPIO_VDDC_ISINK_EN, 0);
    iox_write_pio(GPIO_VDDC_ISINK_RANGE_SEL_A0, 0);
    iox_write_pio(GPIO_VDDC_ISINK_RANGE_SEL_A1, 0);
    iox_write_pio(GPIO_VDDM_ISINK_EN, 0);
    iox_write_pio(GPIO_VDDM_ISINK_RANGE_SEL_A0, 0);
    iox_write_pio(GPIO_VDDM_ISINK_RANGE_SEL_A1, 0);
    iox_write_pio(GPIO_PAD_TIA_RSEL_A0, 0);
    iox_write_pio(GPIO_PAD_TIA_RSEL_A1, 0);
    iox_write_pio(GPIO_SHELBY_IBIAS_SEL, 0);
    iox_write_pio(GPIO_XTAL_CL_SEL_A0, 0);
    iox_write_pio(GPIO_XTAL_CL_SEL_A1, 0);
    iox_write_pio(GPIO_DAC_AD5791_CLRb, 1);
    iox_write_pio(GPIO_AMUX_11_SEL1, 0);
    iox_write_pio(GPIO_AMUX_11_SEL0, 1);
    iox_write_pio(GPIO_AMUX_12_13_SEL1, 0);
    iox_write_pio(GPIO_AMUX_12_13_SEL0, 1);
    iox_write_pio(GPIO_AMUX_14_15_SEL1, 0);
    iox_write_pio(GPIO_AMUX_14_15_SEL0, 1);
    iox_write_pio(GPIO_DAQ_ADC5_SEL0, 0);
    iox_write_pio(GPIO_DAQ_ADC5_SEL1, 0);
    iox_write_pio(GPIO_DAQB_ADC67_SEL1, 1);
    iox_write_pio(GPIO_DAQB_ADC67_SEL0, 1);
    iox_write_pio(GPIO_DAQ_ADC67_SEL0, 0);
    iox_write_pio(GPIO_DAQ_ADC67_SEL1, 1);
    iox_write_pio(GPIO_AMUX_18_19_SEL0, 1);
    iox_write_pio(GPIO_AMUX_18_19_SEL1, 0);
    iox_write_pio(GPIO_AMUX_16_17_SEL0, 1);
    iox_write_pio(GPIO_AMUX_16_17_SEL1, 0);
    iox_write_pio(GPIO_DAC20_FILT_SEL0, 1);
    iox_write_pio(GPIO_LPADC_D0_OE, 1);
    iox_write_pio(GPIO_LPADC_D0_SEL, 0);
    iox_write_pio(GPIO_XTAL_XI_GND_EN, 0);
    iox_write_pio(GPIO_CTRL_VDDC_ISINK1, 0);
    iox_write_pio(GPIO_CTRL_VDDM_ISINK2, 0);
    iox_write_pio(GPIO_VDDC_ISINK_DISABLE, 0);
    iox_write_pio(GPIO_VDDM_ISINK_DISABLE, 0);
    iox_write_pio(GPIO_ABUF_REF_SEL1, 1);
    iox_write_pio(GPIO_ABUF_REF_SEL0, 1);
    iox_write_pio(GPIO_DAC20_FILT_SEL1, 1);
    iox_write_pio(GPIO_MIPI_SEL, 1);
    iox_write_pio(GPIO_MIPI_CTRL, 1);
    iox_write_pio(GPIO_LPADC_D1_OE, 1);
    iox_write_pio(GPIO_LPADC_D1_SEL, 0);
    iox_write_pio(GPIO_UPPER_IO_CTRL, 0);
    iox_write_pio(GPIO_IOM_PC_SEL, 0);
    iox_write_pio(GPIO_IOM_MEM_SEL, 1);					//Changed
    iox_write_pio(GPIO_IOM_VOLT_SEL, 0);				//Changed
	iox_write_pio(GPIO_IOM1_ANA_SEL, 0);				//Added
    iox_write_pio(GPIO_IOM_ANA_SEL, 1);
    iox_write_pio(GPIO_IOM0_LB_SEL, 1);					//Changed
    iox_write_pio(GPIO_IOS_LB_SEL, 1);					//Changed
    iox_write_pio(GPIO_PC_SEL, 1);						//Changed
    iox_write_pio(GPIO_DAC_PERF_MUX_SEL2, 1);
    iox_write_pio(GPIO_DAC_PERF_MUX_SEL1, 1);
    iox_write_pio(GPIO_DAC_PERF_MUX_SEL0, 1);
    iox_write_pio(GPIO_DAQ_DAC7_SEL0, 1);
    iox_write_pio(GPIO_DAQ_DAC7_SEL1, 1);
    iox_write_pio(GPIO_MSPI_nRST_IOX, 1);
    iox_write_pio(GPIO_AT_UART_SEL, 0);
    iox_write_pio(GPIO_GP19_ATST1_A0_SEL, 0);
    iox_write_pio(GPIO_GP19_ATST1_A1_SEL, 0);
    iox_write_pio(GPIO_GP19_ATST1_VV_RLOAD_SEL, 0);
    iox_write_pio(GPIO_GP19_ATST1_IV_GAIN_SEL, 0);
    iox_write_pio(GPIO_GP19_ATST1_XO_SEL, 0);
    iox_write_pio(GPIO_GP18_ATST2_A0_SEL, 0);
    iox_write_pio(GPIO_GP18_ATST2_A1_SEL, 0);
    iox_write_pio(GPIO_GP18_ATST2_VV_RLOAD_SEL, 0);
    iox_write_pio(GPIO_RAIL_PSU_RSEL_A0, 1);
    iox_write_pio(GPIO_RAIL_PSU_RSEL_A1, 1);
    iox_write_pio(GPIO_V1_PSU_RSEL_A0, 1);
    iox_write_pio(GPIO_V1_PSU_RSEL_A1, 1);
    iox_write_pio(GPIO_MSPI0_SEL3, 0);					//Changed
    iox_write_pio(GPIO_MSPI0_SEL2, 0);					//Changed
    iox_write_pio(GPIO_MSPI0_SEL1, 1);					//Changed
    iox_write_pio(GPIO_MSPI0_SEL0, 0);
    iox_write_pio(GPIO_MSPI2_SEL3, 0);					//Changed
    iox_write_pio(GPIO_MSPI2_SEL2, 0);					//Changed
    iox_write_pio(GPIO_MSPI2_SEL1, 1);					//Changed
    iox_write_pio(GPIO_MSPI2_SEL0, 0);
    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL0, 0);
    iox_write_pio(GPIO_MSPI02_PSRAM_CE_SEL1, 0);
//    iox_write_pio(GPIO_IOM1_ANA_SEL, 0);
#if defined BOARD_FALCON_BGA_MCU_CARD_REVB || defined BOARD_FALCON_BGA_MCU_CARD_REVA
    iox_write_pio(GPIO_MSPI1_SEL3, 1);
    iox_write_pio(GPIO_MSPI1_SEL2, 1);
    iox_write_pio(GPIO_MSPI1_SEL1, 0);
    iox_write_pio(GPIO_MSPI1_SEL0, 0);
#endif
#if defined BOARD_FALCON_BGA_MCU_CARD_REVB || defined BOARD_FALCON_SIP_MCU_CARD_REVB
    iox_write_pio(DISP_CLK_SEL, 0);
    iox_write_pio(SWO_ARMADA_EN, 0);
#endif


}


void am_gpio_isr(void)
{
    // Debounce
    am_util_delay_ms(500);

    g_operational_mode += 1;
    g_operational_mode &= 0x7;

    // Clear interrupt
    am_hal_gpio_int_clear(AM_HAL_GPIO_BIT(GPIO_SW2));

}
